import pandas as pd


data = {
    'Имя': ['Лена','Вова','Вика','Андрей','Нина','Виктор','Маша','Марина','Валентин','Зина'],
    'Математика': [5,4,3,4,5,2,5,3,4,4],
    'Физика': [4,5,3,4,2,5,4,3,5,4],
    'Русский': [5,4,4,3,5,4,5,3,4,4],
    'Геометрия': [4,3,5,4,4,2,5,3,4,5],
    'География': [5,5,4,3,4,3,5,4,4,5]
}

df = pd.DataFrame(data)

print(df.head())

print(df.info)

# 3. Средняя оценка по каждому предмету
print("\nСредняя оценка по каждому предмету:")
print(df[['Математика','Физика','Русский','Геометрия','География']].mean())

# 4. Медианная оценка по каждому предмету
print("\nМедианная оценка по каждому предмету:")
print(df[['Математика','Физика','Русский','Геометрия','География']].median())

# 5. Квантили по математике
Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR_math = Q3_math - Q1_math

print(f"\nQ1 (25%) по математике: {Q1_math}")
print(f"Q3 (75%) по математике: {Q3_math}")
print(f"IQR (Q3 - Q1) по математике: {IQR_math}")


std_matematika = df['Математика'].std()
print(f"\nCтандартное отклонение  по математике - {std_matematika}")

